Repository: psignoret/aad-sso-wordpress
Catalog: languages/aad-sso-wordpress-*.po
Languages: de_de

source: Legacy settings have been migrated and the old configuration file has been deleted.
de_de: Alte Einstellungen wurden migriert und die alte Einstellungs-Datei wurde gelöscht.

source: To finish migration, unset <code>AADSSO_SETTINGS_PATH</code> from <code>wp-config.php</code>.
de_de: Um die Migration abzuschließen, entfernen Sie <code>AADSSO_SETTINGS_PATH</code> aus <code>wp-config.php</code>.

source: Legacy settings have been migrated successfully.
de_de: Alte Einstellungen wurden erfolgreich migriert.

source: To finish migration, delete the file at the path <code>%s</code>.
de_de: Um die Migration abzuschließen, entfernen Sie bitte die folgende Datei: <code>%s</code>.

source: Then, unset <code>AADSSO_SETTINGS_PATH</code> from <code>wp-config.php</code>.
de_de: Entfernen Sie anschließend <code>AADSSO_SETTINGS_PATH</code> aus <code>wp-config.php</code>.

source: Legacy settings could not be migrated from <code>%s</code>.
de_de: Alte Einstellungen aus <code>%s</code> konnten nicht migriert werden.

source: Single Sign-on with Azure Active Directory settings have been reset to default.
de_de: Die Single Sign-On mit Azure Active Directory Einstellungen wurden auf die Standardwerte zurückgesetzt.

source: Azure Active Directory Settings
de_de: Azure Active Directory Einstellungen

source: General
de_de: Allgemein

source: Display name
de_de: Anzeigename

source: Domain hint
de_de: Domänen-Hinweis

source: Client secret
de_de: Client Passwort (Secret)

source: Redirect URL
de_de: Weiterleitungs-URL

source: Logout redirect URL
de_de: Weiterleitungs-URL nach Abmeldung

source: Field to match to UPN
de_de: Feld für UPN-Zuordnung

source: Enable auto-provisioning
de_de: Automatische Provisionierung aktivieren

source: Enable auto-forward to Azure AD
de_de: Automatische Weiterleitung zum Azure Active Directory aktivieren

source: Enable Azure AD group to WP role association
de_de: Azure AD Gruppen zu WordPress Rollen Zuordnung aktivieren

source: Default WordPress role if not in Azure AD group
de_de: Standard WordPress-Rolle falls nicht in Azure AD Gruppe

source: WordPress role to Azure AD group map
de_de: WordPress Rollen-Zuordnung zu Azure AD Gruppen

source: Map WordPress roles to Azure Active Directory groups.
de_de: WordPress Rollen zu Azure Active Directory Gruppen zuordnen.

source: WordPress Role
de_de: WordPress-Rolle

source: Azure AD Group Object ID
de_de: Azure Gruppen-Objekt ID

source: Display Name will be shown on the WordPress login screen.
de_de: Anzeigename, welcher auf dem WordPress Anmeldebildschirm angezeigt wird.

source: Provides a hint to Azure AD about the domain or tenant they will be logging in to. If the domain is federated, the user will be automatically redirected to federation endpoint.
de_de: Gibt Benutzern einen Hinweis über die Domäne oder die Organisation, an der sie angemeldet werden. Falls es sich um eine föderierte Domäne handelt, wird der Benutzer zum Föderations-Endpunkt weitergeleitet.

source: The client ID of the Azure AD application representing this blog.
de_de: Die Client ID der Azure AD Anwendung, die diesen Blog repräsentiert.

source: A secret key for the Azure AD application representing this blog.
de_de: Der geheime Schlüssel für die Azure AD Anwendung, die diesen Blog repräsentiert.

source: Set default
de_de: Auf Standard zurücksetzen

source: The URL where the user is redirected to after authenticating with Azure AD. This URL must be registered in Azure AD as a valid redirect URL, and it must be a page that invokes the "authenticate" filter. If you don't know what to set, leave the default value (which is this blog's login page).
de_de: Die URL zu der der Benutzer weitergeleitet wird, nachdem er per Azure AD angemeldet wurde. Diese URL muss in Azure AD als gültige Weiterleitungs-URL hinterlegt sein und es muss sich um eine Seite handeln, die den „authenticate“-Filter von WordPress auslöst. Falls Sie sich über dieses Feld unsicher sind, belassen Sie es auf dem Standard-Wert (der URL zur Login-Seite dieses Blog).

source: The URL where the user is redirected to after signing out of Azure AD. This URL must be registered in Azure AD as a valid redirect URL. (This does not affect logging out of the blog, it is only used when logging out of Azure AD.)
de_de: Die URL, zu der der Benutzer weitergeleitet wird nachdem er sich bei Azure AD abgemeldet hat. Diese URL muss in Azure AD als gültige Weiterleitungs-URL hinterlegt sein. (Dies beeinflusst nicht das Abmelden vom Blog, sondern wird nur verwendet beim Logout von Azure AD.)

source: Email Address
de_de: E-Mail Adresse

source: This specifies the WordPress user field which will be used to match to the Azure AD user's UserPrincipalName. Email Address is fine for most instances.
de_de: Hier geben Sie das Feld eines WordPress Benutzers an, welches zum Abgleich mit dem UserPrincipalName des Azure AD Benutzers verwendet wird. Die E-Mail-Adresse genügt in den meisten Fällen.

source: This is the default role that users will be assigned to if matching Azure AD group to WordPress roles is enabled.
de_de: Dies ist die Standard-Rolle, die Benutzern zugeordnet wird wenn die Zuordnung von Azure AD Gruppen zu WordPress-Rollen aktiviert ist.

source: Automatically create WordPress users, if needed, for authenticated Azure AD users.
de_de: Automatisch Wordpress-Benutzerkonten für authentifizierte Azure AD Benutzer anlegen, falls nötig.

source: Automatically forward users to the Azure AD to sign in, skipping the WordPress login screen.
de_de: Benutzer werden automatisch zum Azure AD Login umgeleitet, der WordPress-Anmeldebildschirm wird übersprungen.

source: Automatically assign WordPress user roles based on Azure AD group membership.
de_de: Automatisch WordPress Benutzerrollen anhand der Zugehörigkeit zu Azure AD Gruppen zuweisen.

source: ANTIFORGERY_ID mismatch. Expecting %s
de_de: ANTIFORGERY_ID stimmt nicht überein. Erwarte %s

source: ERROR: Invalid id_token. %s
de_de: FEHLER: Ungültiges id_token. %s

source: ERROR: Could not get an access token to Azure Active Directory. %s
de_de: Fehler: Konnte kein Access Token für Azure Active Directory erlangen. %s

source: ERROR: An unknown error occured.
de_de: FEHLER: Es trat ein unbekannter Fehler auf.

source: ERROR: Access denied to Azure Active Directory. %s
de_de: FEHLER: Zugriff zu Azure Active Directory verweigert. %s

source: ERROR: The authenticated user %s is not a registered user in this blog.
de_de: FEHLER: Der angemeldete Benutzer %s ist kein registrierter Benutzer dieses Blogs.

source: ERROR: AAD user %s is not a member of any group granting a role.
de_de: FEHLER: AAD Benutzer %s ist kein Mitglied einer Gruppe mit Rollenzuweisung.

source: Single Sign-on with Azure Active Directory required settings are not defined. Update them under Settings > Azure AD.
de_de: Erforderliche Einstellungen für Single Sign-On mit Azure Active Directory wurden nicht definiert. Aktualisieren Sie diese unter Einstellungen > Azure AD.

source: Sign in with your %s account
de_de: Melden Sie sich mit Ihrem %s Konto an

source: Sign out
de_de: Abmelden

source: Single Sign-on with Azure Active Directory
de_de: Single Sign-On mit Azure Active Directory

source: Settings for configuring single sign-on with Azure Active Directory can be configured here.
de_de: Einstellungen für den Single Sign-On mit Azure Active Directory können hier vorgenommen werden.

source: Reset Plugin
de_de: Plugin zurücksetzen

source: Resetting the plugin will completely remove all settings.
de_de: Das Zurücksetzen des Plugins entfernt alle Einstellungen.

source: Reset Settings
de_de: Einstellungen zurücksetzen

source: Reset the plugin to default settings. Careful, there is no undo for this.
de_de: Plugin auf Standard-Einstellungen zurücksetzen. Achtung, diese Aktion kann nicht rückgängig gemacht werden.

source: Migrate Legacy Settings
de_de: Alte Einstellungen migrieren

source: Old configuration data was found at %s.
de_de: Alte Einstellungs-Daten wurden unter %s gefunden.

source: This configuration data can be migrated automatically.
de_de: Diese können automatisch migriert werden.

source: Delete the file at %s to hide this migration utility.
de_de: Löschen Sie die Datei %s um diesen Hinweis auszublenden.

source: If migration is successful, migration will delete this configuration file, %s.
de_de: Falls die Migration erfolgreich abgeschlossen wird, wird die Konfigurationsdatei %s gelöscht.

source: If migration is successful, migration will be unable to delete the configuration file at %s. It is recommended to delete the file after migration.
de_de: Falls die Migration erfolgreich abgeschlossen wird, muss die Konfigurationsdatei %s manuell gelöscht werden. Dies ist empfohlen.

source: Migrate Settings
de_de: Einstellungen migrieren

source: Migrate settings from old plugin versions to new configuration. This will overwrite existing settings! Careful, there is no undo for this.
de_de: Migriert die Einstellungen älterer Plugin-Versionen auf die neue Konfiguration. Hierbei werden existierende Einstellungen überschrieben! Bitte beachten Sie, dass dies nicht rückgängig gemacht werden kann.
